[
    {
        "id": 1,
        "title": "Servex - Call Center Agent Portal",
        "subtitle": "SaaS App | UI/UX Design",
        "projectMainPageImg": "../assets/img/projects/project-1.png",
        "img": "../assets/img/projects/project-details-1.png",
        "alt": "project-details-1",
        "ClientFor": {
            "title": "Client For",
            "content": "Ezsip Pvt. Ltd"
        },
        "Services": {
            "title": "Services",
            "content": "User Interface Design of Agent Portal",
            "link": {
                "title": "flexiflow.com",
                "url": "#"
            }
        },
        "Overview": {
            "title": "Overview",
            "content": "The Servex Agent Portal was designed to streamline call center operations by combining multiple tools into a single, intuitive platform. Agents previously struggled with scattered workflows, switching between different dashboards for dialing, follow-ups, and reporting. My role as a UI/UX Designer was to simplify these processes through research, wireframing, and high-fidelity design in Figma. The portal brings together campaign management, a built-in dialer, customer tracking, and performance reports into one interface, helping agents work faster and enabling supervisors to monitor results more effectively.",
            "listData": [
                {
                    "title": "Research",
                    "content": "To understand agent needs, I conducted quick interviews with 5 agents and 2 supervisors. Their main pain points included slow navigation, missed follow-ups, and difficulty interpreting reports. I also reviewed competitor dashboards like Zoho and Freshdesk to identify best practices. These insights shaped the portal’s structure, ensuring tasks were completed in 2–3 clicks with simplified reporting."
                },
                {
                    "title": "Information Architecture",
                    "content": "I structured the portal into clear modules: Dashboard, Dialer, Customers, Follow-ups, and Reports. This hierarchy helped agents quickly find what they need while giving supervisors a top-level view. User flows were mapped to ensure that common tasks like campaign selection or logging follow-ups required minimal steps, reducing time spent navigating."
                },
                {
                    "title": "Wireframing and Prototyping",
                    "content": " I began with low-fidelity wireframes to test layout options and flows. After validating the structure with stakeholders, I created high-fidelity prototypes in Figma using consistent grids, typography, and color schemes. Interactive prototypes demonstrated the portal’s workflows, helping refine usability before moving into final design."
                }
            ]
        },
        "innerImages": [
            {
                "id": 1,
                "image": "../assets/img/projects/project-details-2.png",
                "altTag": "project-details-2"
            },
            {
                "id": 2,
                "image": "../assets/img/projects/project-details-3.png",
                "altTag": "project-details-3"
            }
        ],
        "Challenges": {
            "title": "Challenges",
            "content": "Designing the Servex Agent Portal came with multiple challenges, from managing complex workflows to ensuring a smooth experience for both agents and supervisors. Since the platform had to handle large volumes of data while remaining user-friendly, it required careful planning of structure, interactions, and visuals. Here are some key challenges and how they were solved:",
            "listData": [
                {
                    "title": "Responsive Design:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Agents accessed the portal on different devices, making it difficult to ensure consistency."
                        },
                        {
                            "title": "Solution",
                            "content": "Applied responsive design with flexible grids and scalable UI components, ensuring the portal worked seamlessly on desktops and tablets."
                        }
                    ]
                },
                {
                    "title": "Data Overload:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "The dashboard contained too much information, overwhelming agents."
                        },
                        {
                            "title": "Solution",
                            "content": "Used progressive disclosure, showing essential KPIs upfront while allowing drill-down for detailed reports."
                        }
                    ]
                },
                {
                    "title": "Navigation Efficiency:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Agents had to switch between multiple dashboards to perform simple tasks."
                        },
                        {
                            "title": "Solution",
                            "content": "Unified core functions (dialer, follow-ups, reports) into a single streamlined portal, reducing clicks and improving speed."
                        }
                    ]
                },
                {
                    "title": "Reporting & Visibility:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Supervisors lacked clarity in monitoring team performance and daily activities."
                        },
                        {
                            "title": "Solution",
                            "content": "Designed interactive charts, color-coded KPIs, and consolidated reports for clear performance tracking."
                        }
                    ]
                }
            ]
        },
        "ResultsConclusion": {
            "title": "Results/Conclusion",
            "content": "The Servex Agent Portal design successfully improved agent productivity and supervisor visibility. Agents were able to complete tasks faster with reduced navigation, while supervisors benefited from simplified reporting and analytics. The clean, responsive UI led to positive feedback from the team, and onboarding for new agents improved by 30%. With its unified structure and modern visuals, the portal became a reliable and efficient tool for daily call center operations. Ongoing updates and user testing will continue to ensure its effectiveness and scalability."
        }
    },
    {
        "id": 2,
        "title": "Vpay. - Online Payment Mobile App",
        "subtitle": "Mobile App Design | UX Design",
        "projectMainPageImg": "../../assets/img/projects/project-2.png",
        "img": "../../assets/img/projects/vpaymain.png",
        "alt": "project-details-2",
        "ClientFor": {
            "title": "Client For",
            "content": "Vpay."
        },
        "Services": {
            "title": "Services",
            "content": "User Interface Design of Payment App",
            "link": {
                "title": "Visit Site",
                "url": "#"
            }
        },
        "Overview": {
            "title": "Overview",
            "content": "The Vpay mobile app was designed to simplify digital payments by combining multiple financial tools into one clean, intuitive interface. Users of traditional payment apps often face cluttered screens, confusing navigation, and difficulty tracking their expenses. \n\nMy role as a UI/UX Designer was to create a minimal yet powerful interface with over 50+ designed screens. The focus was on delivering smooth payment flows, easy transfers, and clear financial insights, while maintaining a visually modern and user-friendly design. The app enables users to send money, pay bills, and monitor transactions with ease, making financial management effortless on mobile devices.",
            "listData": [
                {
                    "title": "Research",
                    "content": "Research: To understand user needs, I conducted quick interviews with 8 participants who regularly use apps like PayPal and Google Pay. Their main pain points included complicated onboarding, unclear transaction history, and weak spending analytics. \n\nI also reviewed leading payment platforms to identify best practices such as biometric login, quick-access actions, and clean dashboards. These findings informed the design approach, ensuring Vpay was both simple for new users and robust for advanced financial tracking."
                },
                {
                    "title": "Information Architecture",
                    "content": "Information Architecture: I structured the app into clear modules: Dashboard, Payments, Transfers, Analytics, Receipts, and Profile. This hierarchy allowed users to quickly access frequent actions like sending money or viewing balances, while keeping secondary features neatly categorized.\nBy mapping out user flows, I ensured that essential tasks—such as completing a payment or checking expenses—were completed within 2–3 taps, reducing friction and improving speed."
                },
                {
                    "title": "Wireframing and Prototyping",
                    "content": "Wireframing and Prototyping: I began with low-fidelity wireframes to test different layouts and flows with users. After validating the structure, I created high-fidelity prototypes in Figma using consistent grids, typography, and color schemes. \n\nInteractive prototypes showcased transaction confirmation, biometric login, and expense charts, helping refine the app’s usability before moving into final design."
                }
            ]
        },
        "innerImages": [
            {
                "id": 1,
                "image": "../assets/img/projects/vpay-details-1.png",
                "altTag": "project-details-2"
            },
            {
                "id": 2,
                "image": "../assets/img/projects/vpay-details-2.png",
                "altTag": "project-details-3"
            }
        ],
        "Challenges": {
            "title": "Challenges",
            "content": "Designing the Vpay payment app required addressing several critical challenges, from ensuring seamless money transfers to building user confidence in security and financial tracking. The platform needed to combine speed, clarity, and trust while avoiding the clutter often found in payment solutions. This meant carefully defining the information architecture, simplifying key interactions, and creating visuals that felt modern yet reliable. The following highlights the major challenges faced and how they were resolved:",
            "listData": [
                {
                    "title": "Responsive Consistency:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Designing a payment app that adapts to multiple mobile screen sizes."
                        },
                        {
                            "title": "Solution",
                            "content": "Applied scalable UI components and auto-layout in Figma to ensure smooth consistency across devices."
                        }
                    ]
                },
                {
                    "title": "Trust & Security:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Users worried about storing card details and making secure payments."
                        },
                        {
                            "title": "Solution",
                            "content": "Integrated biometric login, encryption indicators, and trust signals such as secure icons and confirmation screens."
                        }
                    ]
                },
                {
                    "title": "Financial Clarity:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Users struggled to track and understand their spending habits in competitor apps."
                        },
                        {
                            "title": "Solution",
                            "content": "Designed interactive graphs, filters, and categorized expenses to improve financial transparency."
                        }
                    ]
                }
            ]
        },
        "ResultsConclusion": {
            "title": "Results/Conclusion",
            "content": "The Vpay mobile app design successfully delivered a clean, minimal, and user-friendly experience. Users reported smoother onboarding and faster payment flows, completing transactions up to 40% quicker compared to other apps.\n\nThe addition of clear spending analytics and visual graphs made financial tracking effortless and engaging, while trust-focused design elements increased user confidence in data security.\n\nWith over 50+ screens designed, the app is scalable for future features like rewards, investments, and global transfers. The final outcome positioned Vpay as a modern, reliable, and intuitive solution for digital payments."
        }
    },
    {
        "id": 3,
        "title": "Gifteview - Gift Review Website",
        "subtitle": "Web Design | UI/UX Design",
        "projectMainPageImg": "../assets/img/projects/project-3.png",
        "img": "../assets/img/projects/project-3.png",
        "alt": "project-details-3",
        "ClientFor": {
            "title": "Client For",
            "content": "Gifteview"
        },
        "Services": {
            "title": "Services",
            "content": "User Interface Design of Gift Review Website",
            "link": {
                "title": "Visit Site",
                "url": "#"
            }
        },
        "Overview": {
            "title": "Overview",
            "content": "The Gifteview platform was designed to provide users with an easy way to browse, compare, and review different gift items online. Traditional e-commerce platforms often lack dedicated review-focused experiences, making it difficult for users to evaluate products beyond simple star ratings. My role as a UI/UX Designer was to build a review-centric website with 16+ unique pages, focusing on transparency, usability, and responsive design.\n\nThe platform brings together curated gift listings, user-generated reviews, and category-based navigation into one consistent experience. The goal was to help users make smarter purchasing decisions while providing sellers a clear space to showcase their products with credibility.",
            "listData": [
                {
                    "title": "Research",
                    "content": "Research: To understand user expectations, I conducted short interviews with 6 regular online shoppers and reviewed platforms like Amazon and Etsy to identify usability gaps. Users expressed challenges with scattered reviews, unverified content, and poor filtering options, which made decision-making difficult.\n\nCompetitor analysis highlighted the importance of verified reviews, responsive layouts, and clear product categorization. These insights guided the foundation of Giftereview, ensuring that the website emphasized credibility and ease of navigation while remaining visually engaging."
                },
                {
                    "title": "Information Architecture",
                    "content": "The website was structured into core modules to make navigation simple and intuitive for users."
                },
                {
                    "title": "Wireframing and Prototyping",
                    "content": "Wireframing and Prototyping: I began with low-fidelity wireframes to explore different layouts for category browsing and review flows. After validating with stakeholders, I created high-fidelity prototypes in Figma using consistent grids, typography, and responsive layouts.\n\nInteractive prototypes showcased user journeys such as submitting reviews, filtering products, and navigating across devices. Responsive testing ensured the design adapted seamlessly to desktop, tablet, and mobile experiences."
                }
            ]
        },
        "innerImages": [
            {
                "id": 1,
                "image": "../assets/img/projects/project-details-2.png",
                "altTag": "project-details-2"
            },
            {
                "id": 2,
                "image": "../assets/img/projects/project-details-3.png",
                "altTag": "project-details-3"
            }
        ],
        "Challenges": {
            "title": "Challenges",
            "content": "Designing the Giftereview website involved multiple challenges, from ensuring transparent and credible reviews to keeping the interface clean and user-friendly. The platform had to manage large volumes of product and review data without overwhelming users, while also providing smooth navigation and responsive layouts. Building trust, simplifying browsing, and encouraging user engagement through features like verified reviews and subtle gamification were central to shaping the final design.",
            "listData": [
                {
                    "title": "Review Transparency:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Users often hesitate to trust online reviews due to spam or lack of verification."
                        },
                        {
                            "title": "Solution",
                            "content": "Designed a system that highlights verified reviews and introduces credibility markers for authentic contributions."
                        }
                    ]
                },
                {
                    "title": "Navigation Clarity:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Browsing across multiple categories risked overwhelming users with options."
                        },
                        {
                            "title": "Solution",
                            "content": "Introduced clean filtering, search, and categorization tools to help users find products quickly."
                        }
                    ]
                },
                {
                    "title": "Responsive Design:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "The platform needed to provide a consistent experience across various devices."
                        },
                        {
                            "title": "Solution",
                            "content": "Applied responsive design principles with scalable components to ensure smooth performance on desktop and mobile."
                        }
                    ]
                },
                {
                    "title": "Content Overload:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "With multiple gift items and reviews displayed on each page, there was a risk of overwhelming users with too much information at once."
                        },
                        {
                            "title": "Solution",
                            "content": "Implemented progressive disclosure by prioritizing essential product details and collapsing secondary information into expandable sections, keeping the interface clean and scannable."
                        }
                    ]
                },
                {
                    "title": "User Engagement:",
                    "content": [
                        {
                            "title": "Challenge",
                            "content": "Encouraging users to contribute reviews consistently was difficult, as many preferred browsing over writing feedback."
                        },
                        {
                            "title": "Solution",
                            "content": "Introduced subtle gamification elements like contributor badges, review counts, and personalized prompts to motivate participation and increase user-generated content."
                        }
                    ]
                }
            ]
        },
        "ResultsConclusion": {
            "title": "Results/Conclusion",
            "content": "The Giftereview website successfully delivered a user-friendly, transparent, and responsive experience for exploring and evaluating gift items. Users found it easier to compare products, filter categories, and rely on credible reviews when making purchase decisions.\n\nWith 16+ pages designed, the platform positioned itself as a reliable alternative to traditional shopping sites by prioritizing review transparency and usability. The design framework also allows for future scalability, such as adding personalized recommendations and community-driven features."
        }
    }
]